drug_db = {'alco' : {'info' : '''<b>Алкоголь</b>
Алкоголь - самый потребляемый наркотик в западных странах. Он допускается обществом, поэтому каждый сталкивался с ним. Алкоголь -- опаснейший наркотик, признанный самым вредоносным. Употребляйте с большой осторожностью! О вреде алкоголя знает каждый, но, увы, большинство его игнорирует.

\U0001F449<b>Дозировка:</b> пороговая - 1 единица, лёгкая - 2 ед, стандартная - 2-4 ед, сильная - 4-6 ед, тяжёлая - более 6 ед.

\U0001F449<b>Алкогольные единицы:</b>
1 ед -- стакан(280мл) лёгкого пива, шот(25мл)
1,5 ед -- маленький бокал вина(125мл)
2 ед -- стакан крепкого(6.5%) пива, бутылка пива (500мл), средний бокал вина(175мл)
3 ед -- бутылка крепкого пива, большой бокал вина (250мл)
9 единиц -- бутылка вина (750мл)

\U0001F449<b>Толерантность:</b> развивается после долгосрочного употребления. После её развития требуется от 3 дней до 2 недель для восстановления.

\U0001F449<b>Рекомендации к приёму:</b>
\U00002022 Всегда начинайте с легкой дозы, чтобы узнать, как наркотик действует на вас.
\U00002022 Пейте один стакан воды на каждую порцию алкоголя и отдохните до и после. Примите дополнительно витамин B.
\U00002022 Пейте только для удовольствия и отдыха. И только, если у вас хорошее физическое и психологическое самочувствие.
\U00002022 Не пейте алкоголь для утоления жажды
\U00002022 Не принимайте его каждый день.
\U00002022 Не комбинируйте его с другими наркотиками, успокаивающими и другими лекарствами.
\U00002022 Ни в коем случае не садитесь за руль. Это чрезвычайно опасно.
\U00002022 <b>Если вы видите человека, потерявшего сознание от опьянения -- обязательно переверните его на живот.</b> Захлёбывание собственной рвотой -- одна из самых распространенных причин смерти от употребления алкоголя.

\U0001F449<b>Опасные взаимодействия:</b>
\U00002022 <b>Смертельный исход возможен в комбинации с депрессантами: опиатами, барбитуратами, бензодиазепинами, тиенодиазепинами, другими ГАБА-эргическими веществами.</b>
\U00002022 В комбинации с диссоциативами алкоголь вызывает обильную рвоту в бессознательном состоянии, что может привести к смерти от захлебывания рвотой.
\U00002022 Опасно комбинировать со <b>стимуляторами</b> -- риск чрезмерной интоксикации.
\U00002022 Опасно комбинировать с <b>антидепрессантами</b> (посоветуйтесь с врачом или инструкцией)''', 'photo' : 'AgADAgADrKcxG8mdJBF5JJ8oT_5GRyUMSw0ABPnPxVcQVZshO2QDAAEC'},
'mdma' : {'info' : '''<b>МДМА</b>

\U0001F449<b>Синонимы:</b> <i>колеса, экстази, дима, эмка</i>.

\U0001F449<b>Формы: </b>кристаллы(должны быть прозрачными или слегка мутными), таблетки(могут содержать примеси!).

\U0001F449<b>Дозировка:</b> пороговая - 40мг, легкая - 40-75мг, стандартная - 75-150мг, тяжелая - от 200мг.

\U0001F449<b>Толерантность:</b> высокая (до месяца).

\U0001F449<b>Рекомендации к приёму:</b>
\U00002022 Употребляйте не чаще 2-3 раз в месяц
\U00002022 Всегда начинайте с легкой дозы, чтобы узнать, как наркотик действует на вас.
\U00002022 Отдыхайте до и после приема МДМА и ешьте еду, богатую антиоксидантами и витаминами, такую как брокколи, апельсины и киви. Если не хочется есть, можете сделать смузи.
\U00002022 Убедитесь, что вы безопасном месте с друзьями.
\U00002022 Когда танцуете, помните, что надо регулярно охлаждаться и пить один (максимум два) стакана воды.
\U00002022 Не садитесь за руль!

\U0001F449<b>Эффекты</b>
<b>Физические:</b> приятные ощущения в теле, расширение зрачков, ‘вибрирующее’ и искаженное зрение, обезвоживание, снижение аппетита, повышенная температура, резкие движения челюстями и скрежет зубов
<b>Когнитивные:</b> эйфория, повышенные чувства любви, эмпатии, социальности, искажение времени, снижение тревожности, повышенное либидо. Возможны галлюцинации.
<b>Слуховые</b> искажения и галлюцинации
\U0001F449<b>Последствия(временные):</b> тревожность, снижение аппетита, усталость

\U0001F449<b>Опасные взаимодействия:</b>
Никогда не мешайте МДМА с алкоголем, стимуляторами, галлюциногенами.
<b>С антидепрессантами:</b> возможен риск <b>серотонинового синдрома -- жизненно-опасного уровня серотонина в мозге. MDMA нельзя совмещать с SR-, SSRI-, MAOI-, 5-HTP-препаратами.</b> ''', 'photo' : 'AgADAgADqacxG8mdJBEHkuKUd9KpGKoMSw0ABOc-_C2g6ND-m2QDAAEC'},

'amph' : {'info' : '''<b>Амфетамин (левоамфетамин, декстроамфетамин)</b>

\U0001F449<b>Синонимы:</b> <i>спид, шпек, скорость</i>

\U0001F449<b>Фармакологические препараты (в США):</b> Adderall

\U0001F449<b>Форма выпуска:</b> порошок(черный рынок), таблетки

\U0001F449<b>Дозировка:</b> пороговая - 10мг, легкая - 30мг, стандартная - 30-65мг, тяжелая - от 80мг

\U0001F449<b>Толерантность:</b> развивается быстро, что вызывает зависимость.

\U0001F449<b>Рекомендации к приёму:</b>
\U00002022 <b>НЕ ПРИНИМАЙТЕ амфетамин, если вы плохо переносите стимуляторы; при высоком давлении, болезнях сердца, болезнях почек, психических болезнях, сахарном диабете; при нервозности, напряжении, тревоге (амфетамин их усилит).</b>
\U00002022 <b>Не принимайте амфетамин, чтобы справиться с депрессией или усталостью. Это приведет к зависимости.</b>
\U00002022 Всегда начинайте с легкой дозы, чтобы узнать, как наркотик действует на вас.
\U00002022 Амфетамин лучше глотать. Его вдыхание повреждает слизистую носа и способствует более быстрому привыканию.
\U00002022 Плотно поешьте до, во время и после приема, чтобы смягчить эффект похмелья (орехи, брокколи, киви и т.д.). Если трудно есть твердую пищу - приготовьте смузи.
\U00002022 Если вы нюхаете амфетамин -- не используйте чужую трубочку. В ней могут быть остатки других наркотиков.
\U00002022 Избегайте перегрева, не надевайте теплой одежды и головных уборов.
\U00002022 Пейте в час не более двух стаканов воды или освежающего напитка во избежание гипергидратации.
\U00002022 Во время действия жуйте резинку без сахара. Это стимулирует выделение слюны и помогает от зубовного скрежета.
\U00002022 <i>После приёма лучше останьтесь у друзей - отходняки могут быть очень неприятными.</i>

\U0001F449<b>Эффекты</b>
<b>Физические:</b> тонус, лёгкость в теле, дрожь, повышенный сердечный ритм, обезвоживание
<b>Когнитивные:</b> эйфория, повышение аналитических и креативных способностей, фокус(наибольший при низких и средних дозах)

\U0001F449<b>Последствия(временные):</b> снижение мотивации, тревожность, бессонница, раздражительность

\U0001F449<b>Опасные взаимодействия:</b>
<b>Никогда не сочетайте спид с другими наркотиками или алкоголем, это опасно.</b>
<b>С MDMA может усилиться нейротоксичность.</b>
<b>С антидепрессантами: амфетамин увеличивает количество допамина, что может быть опасно и даже летально.</b>
<b>После приёма:</b>
\U00002022 Если вы нюхали амфетамин, перед сном прочистите нос с помощью спрея или ватной палочки, чтобы удалить все остатки.
\U00002022 Не садитесь за руль!''', 'photo' : 'AgADAgADq6cxG8mdJBEUF93vE_5J8onSgQ0ABOByvoANh_dl_h4EAAEC'},

'gomk': {'info' : '''<b>Бутират</b>
Бутират -- наркотик, создающий эффекты, похожие на алкогольное опьянение и MDMA. Он становится все более популярным, но на самом деле довольно опасен.

\U0001F449<b>Синонимы:</b> <i>GHB, Xyrem, жидкий экстази, lollipops</i>

\U0001F449<b>Формы:</b> соль(порошок), раствор(должна быть написана точная концентрация!), Xyrem -- медицинский препарат, содержащий GHB

\U0001F449<b>Дозировка:</b> легкая - 0.5-1г, стандартная - 1-2.5г, сильная - 2-4г, тяжёлая - 5-10г(опасно! риск смерти!)

\U0001F449<b>Толерантность:</b> <i>бутират вызывает довольно сильную толерантность и привыкание после нескольких недель постоянного использования.</i> Симптомы привыкания включают тревожность, психоз, бессонницу и др. Толерантность снимается 7-14 дней после прекращения принятия.

\U0001F449<b>Рекомендации к приёму:</b>
\U00002022 <b>Всегда начинайте с малой дозы, чтобы узнать, как наркотик действует на вас. Внимание! С бутиратом очень важно медленно и постепенно увеличивать дозу.</b>
\U00002022 <b>GHB нужно растворять в жидкости(не в алкоголе!) и не пить всё за раз.</b> Доза в 4g может привести к конвульсиям, потере сознания, сопровождающейся рвотой.
\U00002022 Не принимайте бутират, если он разведен не при вас или вы не можете узнать точно, сколько вещества содержится в растворе!
\U00002022 Отметьте,сколько миллилитров(граммов) бутирата вы приняли и когда, можно на телефоне.
\U00002022 Если хотите принять ещё, <i>не делаете это раньше, чем через 1.5 часа и принимайте не больше половины первой дозы.</i>
\U00002022 Принимайте бутират не раньше, чем через два часа после еды, потому что принятие бутирата на полный желудок может вызвать рвоту, а на пустой желудок может привести к передозировке.
\U00002022 Если под действием бутирата вам станет жарко, не снимайте много одежды, потому что бутират может привести к гипотермии.
\U00002022 Никогда не садитесь за руль под действием наркотика или сразу после этого.
\U00002022 <b>Если вы заметили лежащего человека, потерявшего сознания от бутирата, обязательно переверните его на живот! Это спасет его от захлебывания рвотой.</b>

\U0001F449<b>Эффекты</b>
<b>Физические:</b> стимуляция при малых дозах, седативность/вялость при больших; респираторная депрессия при больших дозах, потеря моторного контроля, тошнота, интенсивный оргазм
<b>Когнитивные:</b> эмпатия, любовь, социальность, провалы в памяти, эйфория, усиление либидо, подавление тревожности, частичная остановка мыслей
\U0001F449<b>Опасные взаимодействия:</b>
<b>Очень опасно смешивать с депрессантами (алкоголь, барбитураты, опиаты, габапентином, прегабалином, фенибутом, бензодиазепинами) -- повышается риск респираторной депрессии -- нарушения дыхания вплоть до его остановки.</b>
По данным о 194 смертях от бутирата, <b>большинство смертей было вызвано его взаимодействием с другими наркотиками.
С диссоциативами и стимулянтами </b> увеличивается риск интоксикации, бессознательной рвоты.''', 'photo' : 'AgADAgADracxG8mdJBFG4cXQIyqF1qIxSw0ABKDhNnjOJOEV8XcDAAEC'},
'cocaine' : {'info' : '''<b>Кокаин</b>

\U0001F449<b>Синонимы:</b> <i>кокс, crack</i>

\U0001F449<b>Формы:</b> соль(растворим в воде) - употребляют в основном нозально, крэк(порошок, полученный после реакции с содой и водой) - курят.

\U0001F449<b>Дозировка:</b> пороговая - 10-20мг, лёгкая 20-50мг, стандартная 50-100мг, сильная - до 150мг, тяжёлая - больше 150мг

\U0001F449<b>Продолжительность:</b> 10-90 мин

\U0001F449<b>Толерантность:</b> как и другие стимуляторы, вызывает быструю толерантность и развивает зависимость.

\U0001F449<b>Рекомендации к приёму:</b>
\U00002022 Используйте проверенные источники. Безопасность прежде всего. Тестируйте вещество. Кокаин может содержать опасные примеси.
\U00002022 <b>НЕ принимайте при болезнях сердечно-сосудистой системы.</b>
\U00002022 Всегда начинайте с легкой дозы, чтобы узнать, как наркотик действует на вас.
\U00002022 Будьте в хорошей физической и эмоциональной форме, не используйте при усталости и депрессии.
\U00002022 Используйте собственную трубочку (возможны инфекции)
\U00002022 После приема хорошо прочистите нос.
\U00002022 На следующий день хорошо поешьте и отдохните.

\U0001F449<b>Эффекты</b>
<b>Физические:</b> повышенный/ненормальный сердечный ритм, подавленный аппетит,  улучшение контроля тела, снижение боли, скрежет зубами
<b>Когнитивные:</b> эйфория, фокус(при низких дозах), повышение мотивации, либидо, усиление мыслительного процесса, <i>компульсивный редозинг(повторное употребление)</i>
<b>Последствия:</b> тревожность, усталость, депрессия, снижение мотивации, снижение интеллектуальной деятельности
\U0001F449<b>Опасные взаимодействия:</b>
<b>Со стимуляторами</b> может опасно усилить сердцебиение вплоть до остановки сердца, вызывать припадки, чрезмерные нагрузки на сосуды.
<b>С депрессантами</b> (опиатами,бензодиазепинами, алкоголем) производит антагонистический эффект на кровеносную систему, что вызывает нагрузку и опасность остановки сердца.
<b>При взаимодействии с алкоголем</b> кокаин образует побочные соединения, неоднозначно влияющие на организм. Повышенная опасность интоксикации.
Нейротоксические свойства <b>MDMA</b> могут повыситься.
<b>Никотин</b>, повышая уровень допамина, приводит к неконтролируемому курению во время употребления кокаина.

<i>Лучше не принимать совсем или делать это изредка, так как кокаин -- сильный и опасный наркотик.</i>''', 'photo' : 'AgADAgADqqcxG8mdJBEnQVch2jUaBmkPSw0ABIRvZpG8P-oVjmEDAAEC'},
'lsd' : {'info' : '''<b>ЛСД</b>

\U0001F449<b>Синонимы:</b> кислота, марка

\U0001F449<b>Формы:</b> капли, таблетки, марки. <i>ЛСД разрушается под воздействием прямых солнечных лучей и кислорода. Но в темном прохладном месте может храниться до нескольких лет.</i>

\U0001F449<b>Дозировка:</b> пороговая - 15-50мкг, лёгкая - 25-75мкг, стандартная - 75-200мкг, сильная - 200-400мкг, тяжёлая - более 400мкг.

\U0001F449<b>Толерантность:</b> вырабатывается сразу после употребления и длится 3-7 дней.
Не вызывает зависимости совсем. Фактически, желание употреблять ЛСД только снижается со временем.

\U0001F449<b>Рекомендации к употреблению:</b>
\U00002022 <b>НЕ принимайте при диагностированных психических заболеваниях и депрессии.</b>
\U00002022 Всегда тестируйте ваш ЛСД, чтобы быть уверенным, что это действительно она и сколько в марке микрограмм.
\U00002022 Всегда начинайте с малой дозировки. Если вы употребляете ЛСД в первый раз, убедитесь, что вы в привычной обстановке и чувствуете себя хорошо ментально и физически.
\U00002022 Если эффекты негативные, можете снизить их, приняв витамин C, глюкозу или сладкий напиток.
\U00002022 Убедитесь, что хорошо поели предварительно.
\U00002022 Не боритесь с чувствами, следуйте потоку.
\U00002022 Убедитесь, что у вас нет дел на следующий день после трипа, так как вам действительно понадобится время для восстановления.
\U00002022 Если вам не нравятся ощущения от грибного трипа, то, возможно, ЛСД тоже не подойдёт.

\U0001F449<b>Эффекты</b>
<b>Физические:</b> спонтанные тактильные ощущения, стимуляция, тошнота, усиление сердцебиения, расширение зрачков.
<b>Когнитивные:</b> усиление эмоций, впечатлений, абстрактного мышления, креативности, либидо; дежа-вю, смех, искажение времени; широчайший  сложно классифицируемый спектр ощущений :)
<b>Слуховые:</b> галлюцинации, искажения

\U0001F449<b>Последствия:</b> усталость, тревожность, головная боль

\U0001F449<b>Опасные взаимодействия:</b> с трамадолом, стимуляторами, литием
При приёме с <b>каннабисом, диссоциативами</b> время и интенсивность трипа значительно усилятся(может быть опасно, не смешивайте без большой уверенности)
Взаимодействие с <b>МДМА и психоделиками</b> вызывает усиление действия обоих веществ, но <i>очень непредсказуемо</i>. ''', 'photo' : 'AgADAgADrqcxG8mdJBG6EKMkOaYpusjXgQ0ABJVAhxpYopehliQEAAEC'}
}